{
    "Blogs": [
        {
            "pic":  "TACO.png",
            "title": "TACO: Visualizing Changes in Tables Over Time",
            "content": "<p>As one of the most common data structures, tabular data may change over time in four types: structural (add/remove), content, reorder, and split/merge (each type is encoded by a consistent and distinguished color across this work). Considering the requirements of inspection and comparison along a set of these changes, this work designs a multilevel visualization framework to provide an overview+detail exploration.</p><p>An important and challenging task when making sense such data is to investigate the difference between multiple versions of a table, for instance, to detect modifications in monthly payroll tables or to observe differences in multiple biological experiments.</p><p>First is timeline overview. Stacked bars placed on the top of time ticks are used to present the ratios of each type of changes between consecutive versions of table. Then the aggregated pairwise comparison applies an abstract and compact visualization to encode the distribution of changes between the tables. It also directly shows meta-information about the table. Furthermore, this work designs a visualization to support detailed pairwise comparison. Pixel-based diff heatmap encodes the four possible change types in a tailored way.</p>",
            "ref": "Niederer C, Stitz H, Hourieh R, et al. TACO: Visualizing Changes in Tables Over Time[J]. IEEE Transactions on Visualization & Computer Graphics, 2018, PP(99):1-1."
        },
        {
            "pic": "mobike.png",
            "title": "Planning Bike Lanes based on Sharing-Bikes' Trajectories",
            "content": "<p>Since the Mobike is a type of station-free sharing-bike, the trajectories of Mobike users reflect actual urban travel demands. This work proposes a data-driven approach to plan bike lanes under real world constraints, based on a large scale sharing bikes trajectories.</p><p>The problem is formulated as a constrained optimization problem, which maximizes the total beneficial score, and fulfills two constraints: 1) the total budget is no more than B, and 2) the number of connected components is less than k.</p><p>They prove the NP-hardness of the problem and propose greedy-based heuristics to address it, as same as the 0-1 Knapsack problem. The algorithm firstly selects k road segments as the starting edges and then expands the network by iteratively adding the road that has the lowest ratio of the cost and beneficial score, until the budget is insufficient.</p>",
            "ref": "Bao J, He T, Ruan S, et al. Planning Bike Lanes based on Sharing-Bikes' Trajectories[C]// ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 2017:1377-1386."
            
        },
        {
            "pic": "moba.png",
            "title": "A Visual Analytics Approach for Understanding Reasons behind Snowballing and Comeback in MOBA Games",
            "content": "<p>Moba Game designers need to gain in-depth insight from the game progress, especially the snowballing and comeback, to improve the game balance and the trade-off between entertainment and competitive. </p><p>In one hand, the heterogeneous multi-dimensional spatio-temporal data generated from the Moba game hinders the game analysis. Furthermore, game developers often find it difficult to determine their causes and triggers with so many game design choices and game parameters involved. </p><p>This work designs six coordinated views to tackle above challenges. A set of tailored widgets encode the game information, including the battle, hero’s level improvement, equipment evolution, etc, along the coordinated timeline.</p>",
            "ref": "Li Q, Xu P, Chan Y Y, et al. A Visual Analytics Approach for Understanding Reasons behind Snowballing and Comeback in MOBA Games[J]. IEEE Transactions on Visualization & Computer Graphics, 2016, 23(1):211-220."
        },
        {
            "pic": "HOLA.png",
            "title": "HOLA: Human-like Orthogonal Network Layout",
            "content": "<p>This work presents a new “human-centred” methodology for automatic network layout algorithm design that uses both formative and summative user studies. They fisrtly investigates which kinds of orthogonal network layout human like and identified nine significant results by asking participants to manually improve the layout and rank them. Furthermore, they proposed a novel algorithm (HOLA) integrated the results to generate human-like layout.</p>",
            "ref": "Kieffer S, Dwyer T, Marriott K, et al. HOLA: Human-like Orthogonal Network Layout[J]. IEEE Transactions on Visualization & Computer Graphics, 2015, 22(1):349-358."
        },
        {
            "pic": "JDR.png",
            "title": "A Visual Analytics Approach for Categorical Joint Distribution Reconstruction from Marginal Projections",
            "content": "<p>Oftentimes multivariate data are not available as sets of equally multivariate tuples, but only as sets of projections into subspaces spanned by subsets of these attributes. To leverage domain expert's knowledge into categorical joint distribution reconstruction from marginal projection, this work develops a visual analytics approach.</p><p>A backend is developed to stores massive solutions reconstructed by mathematical method and filtered according to realistic constraints, which facilitates seamless interaction. Besides, a tailored visualization consisting mainly of augmented parallel coordinates is also designed to incorporate domain knowledge for further exploration. When the dimensionality of the solution space is large, there will be too many axes in the parallel coordinates display. To tackle this problem, different types of features are computed automatically according to some principles or set by the user manually.</p>",
            "ref": "Cong X, Wen Z, Mueller K. A Visual Analytics Approach for Categorical Joint Distribution Reconstruction from Marginal Projections[J]. IEEE Transactions on Visualization & Computer Graphics, 2016, 23(1):51-60."
        },
        {
            "pic": "vismate.png",
            "title": "Vismate: Interactive Visual Analysis of Station-Based Observation Data on Climate Changes",
            "content": "<p>This work proposes a visual analytic framework for better exploration of station-based observation data on climate changes. It is claimed that it was the first comprehensive information visualization technique specialized in climate changes. To meet the requirements of inspecting spatio-temporal distribution and characteristic and anomaly detection, this work presents a prototype which consists of three well-designed modules.</p><p>Firstly, Radial Map provides an intuitive and compact visualization by integrating both the spatial and temporal features. As a common and conventional visual encoding, warm and cold colors are used to encode the positive and negative changes. Besides, the stations are clustered according to their slope that a feature reflecting the trend of changes, and drawn on corresponding concentric rings.</p><p>Then the Time Series Disc is designed for a cluster of stations, consisting a series of triangle components. A triangle component encodes change rate between every pair of years of each station. In addition, a scatterplot is utilized for anomaly detection.</p><p>More visual encodings can be read in the paper.</p>",
            "ref": "Li J, Zhang K, Meng Z P. Vismate: Interactive visual analysis of station-based observation data on climate changes[C]// Visual Analytics Science and Technology. IEEE, 2015:133-142."
        },
        {
            "pic": "TMDS.png",
            "title": "Temporal MDS Plots for Analysis of Multivariate Data",
            "content": "<p>This work designs an explorative visualization of temporal multi-dimensional data. The main idea of such design is to integrate temporal attribute and 1D similarity value on a 2D-plot, from which the analysts can gain insight of temporal trend with respect to a cluster of entries.</p><p>To preserve similarity value smooth and avoid significant fluctuation in TMDS plot, overlaid sliding window technique is used to ensure that each step of similarity calculation considers some entries same as the previous step. To support the process of finding patterns also dimension-wise, they introduce a diversity matrix as a heatmap which is displayed below the TMDS plot, aligned with the sliding window.</p>",
            "ref": "Jackle D, Fischer F, Schreck T, et al. Temporal MDS Plots for Analysis of Multivariate Data[J]. IEEE Transactions on Visualization & Computer Graphics, 2016, 22(1):141."
        },
		{
			"pic": "infoNice.png",
			"title": "InfoNice: Easy Creation of Information Graphics",
			"content": "<p>Since embellished marker used as visual element facilitate exploration, presentation and storytelling, this work presents a visualization design tool, namely InfoNice, which allows users to convert unembellished charts into infographics with multiple visual elements through mark customization.</p><p>To support faster and smoother iteration during design and in order to bridge the gap between analysis and presentation, InfoNice has been implemented into Microsoft Power BI monitoring the changes of the data.</p><p>The potential benefits of this integrated design for data-driven infographics creation is revealed by an in-lab user study and a real-world end-user survey.</p>",
			"ref": "Wang Y, Zhang H, Huang H, et al. InfoNice: Easy Creation of Information Graphics[C]// CHI Conference. 2018:1-12"
		},
		{
			"pic": "ECG.png",
			"title": "ECGLens: Interactive Visual Exploration of Large Scale ECG Data for Arrhythmia Detection",
			"content": "<p>A single ECG observation is used for diagnosis, making it difficult to detect irregular arrhythmias. However, in-depth analysis of long term ECG data causes time-consuming process which hinder comprehensive and accurate diagnosis.</p><p>To tackle the challenges, this work proposes a framework integrating automatic anomaly detection algorithms and interactive visualization system named ECGlens.</p><p>In addition to multiple linked views supporting interactive exploration, a tailored succinct glyph, namely A-glyph, is designed for visual summary of arrhythmias. To demonstrate its effectiveness in arrhythmia detection, a comprehensive user study is conducted.</p>",
			"ref": "Xu K, Guo S, Cao N, et al. ECGLens: Interactive Visual Exploration of Large Scale ECG Data for Arrhythmia Detection[C]// CHI Conference. 2018:1-12."
		},
		{
			"pic": "ConceptMap.png",
			"title": "Improving User Confidence in Concept Maps: Exploring Data Driven Explanations",
			"content": "<p>Despite concept map has been widely used in decision making and planning, the gap between the presentation and original data hinders user from conveying discovery confidently and even convincing others.</p><p>This paper presents a study to investigate how data-driven explanation improve user confidence in concept map, also the difference between two forms of concept map generation. The result shows that the bottom-up methods which repeatedly aggregate pairs of concepts into clusters  outperform and data-driven explanation helps improve confidence.</p>",
			"ref": "Bras P L, Robb D A, Methven T S, et al. Improving User Confidence in Concept Maps: Exploring Data Driven Explanations[C]// CHI Conference. 2018:1-13."
		}
    ]
}
